
const YoutubeIcon = (props) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    viewBox="0 0 32 41" // Mantiene las dimensiones del dibujo
    fill="none"
    {...props} // Permite pasar className, style, width, height, etc.
  >
    {/* Contenedor del ícono, usando 'currentColor' y grosor de línea */}
    <g
      stroke="currentColor" 
      strokeWidth={3} 
      strokeLinecap="round"
      strokeLinejoin="round"
    >
      {/* El marco (la forma de TV o video) */}
      <path 
        d="M30.0538 10.9677C29.8954 10.1569 29.5728 9.41406 29.1186 8.81415C28.6645 8.21424 28.0948 7.77852 27.4671 7.551C25.1738 6.8335 16.0004 6.8335 16.0004 6.8335C16.0004 6.8335 6.8271 6.8335 4.53377 7.61933C3.9061 7.84685 3.33641 8.28257 2.88223 8.88248C2.42806 9.48239 2.10549 10.2252 1.9471 11.036C1.52739 14.018 1.32208 17.043 1.33377 20.0731C1.31881 23.126 1.52413 26.1741 1.9471 29.1785C2.12172 29.9641 2.45151 30.6787 2.90463 31.2532C3.35775 31.8278 3.91886 32.2429 4.53377 32.4585C6.8271 33.2443 16.0004 33.2443 16.0004 33.2443C16.0004 33.2443 25.1738 33.2443 27.4671 32.4585C28.0948 32.231 28.6645 31.7953 29.1186 31.1953C29.5728 30.5954 29.8954 29.8526 30.0538 29.0418C30.4702 26.0823 30.6755 23.0803 30.6671 20.0731C30.6821 17.0202 30.4767 13.9721 30.0538 10.9677Z" 
      />
      {/* El botón de play (triángulo) */}
      <path 
        d="M13.0004 25.6593L20.6671 20.0731L13.0004 14.4868V25.6593Z" 
      />
    </g>
  </svg>
)

export default YoutubeIcon